{
	"@metadata": {
		"authors": [
			"Shirayuki",
			"Yuvi Panda"
		]
	},
	"mobileapp-desc": "{{desc|name=Mobile App|url=https://www.mediawiki.org/wiki/Extension:MobileApp}}",
	"tag-app-suggestededit": "Short edit tag name for edits that were made from the Suggested Edits feature in the mobile apps.",
	"tag-app-suggestededit-description": "Edit tag description for edits that were made from the Suggested Edits feature in the mobile apps.",
	"tag-app-suggestededit-helppage": "Link to a page where users learn about the feature for edits that were made from the Suggested Edits feature in the mobile apps.",
	"tag-app-undo": "Short edit tag name for Undo actions that were done from the mobile apps.",
	"tag-app-undo-description": "Edit tag description for Undo actions that were done from the mobile apps.",
	"tag-app-undo-helppage": "Link to a page where users learn about the feature for Undo actions that were done from the mobile apps.",
	"tag-app-rollback": "Short edit tag name for Rollback actions that were done from the mobile apps.",
	"tag-app-rollback-description": "Edit tag description for Rollback actions that were done from the mobile apps.",
	"tag-app-rollback-helppage": "Link to a page where users learn about the feature for Rollback actions that were done from the mobile apps.",
	"tag-app-description-add": "Short edit tag name for short descriptions that were added from the mobile apps.",
	"tag-app-description-add-description": "Edit tag description for short descriptions that were added from the mobile apps.",
	"tag-app-description-add-helppage": "Link to a page where users learn about the feature for short descriptions that were added from the mobile apps.",
	"tag-app-description-change": "Short edit tag name for changes made to short descriptions from the mobile apps.",
	"tag-app-description-change-description": "Edit tag description for changes made to short descriptions from the mobile apps.",
	"tag-app-description-change-helppage": "Link to a page where users learn about the feature for changes made to short descriptions from the mobile apps.",
	"tag-app-description-translate": "Short edit tag name for translations of short descriptions that were made from the mobile apps.",
	"tag-app-description-translate-description": "Edit tag description for translations of short descriptions that were made from the mobile apps.",
	"tag-app-description-translate-helppage": "Link to a page where users learn about the feature for translations of short descriptions that were made from the mobile apps.",
	"tag-app-section-source": "Short edit tag name for edits made from the article section source editor in the mobile apps.",
	"tag-app-section-source-description": "Edit tag description for edits made from the article section source editor in the mobile apps",
	"tag-app-section-source-helppage": "Link to a page where users learn about the feature for edits made from the article section source editor in the mobile apps",
	"tag-app-full-source": "Short edit tag name for edits made from the article full source editor in the mobile apps.",
	"tag-app-full-source-description": "Edit tag description for edits made from the article full source editor in the mobile apps",
	"tag-app-full-source-helppage": "Link to a page where users learn about the feature for edits made from the article full source editor in the mobile apps",
	"tag-app-select-source": "Short edit tag name for edits made from selecting an article word in the mobile apps.",
	"tag-app-select-source-description": "Edit tag description for edits made from selecting an article word in the mobile apps",
	"tag-app-select-source-helppage": "Link to a page where users learn about the feature for edits made from selecting an article word in the mobile apps",
	"tag-app-talk-source": "Short edit tag name for edits made from the talk page full source editor in the mobile apps.",
	"tag-app-talk-source-description": "Edit tag description for edits made from the talk page full source editor in the mobile apps",
	"tag-app-talk-source-helppage": "Link to a page where users learn about the feature for edits made from the talk page full source editor in the mobile apps",
	"tag-app-talk-reply": "Short edit tag name for a talk page inline reply in the mobile apps.",
	"tag-app-talk-reply-description": "Edit tag description for a talk page inline reply in the mobile apps",
	"tag-app-talk-reply-helppage": "Link to a page where users learn about the feature for a talk page inline reply in the mobile apps",
	"tag-app-talk-topic": "Short edit tag name for a new talk page topic in the mobile apps.",
	"tag-app-talk-topic-description": "Edit tag description for a new talk page topic in the mobile apps",
	"tag-app-talk-topic-helppage": "Link to a page where users learn about the feature for a new talk page topic in the mobile apps",
	"tag-app-image-caption-add": "Short edit tag name for image captions that were added from the mobile apps.",
	"tag-app-image-caption-add-description": "Edit tag description for image captions that were added from the mobile apps",
	"tag-app-image-caption-add-helppage": "Link to a page where users learn about the feature for image captions that were added from the mobile apps",
	"tag-app-image-caption-translate": "Short edit tag name for translations of image captions that were made from the mobile apps.",
	"tag-app-image-caption-translate-description": "Edit tag description for translations of image captions that were made from the mobile apps",
	"tag-app-image-caption-translate-helppage": "Link to a page where users learn about the feature for translations of image captions that were made from the mobile apps",
	"tag-app-image-tag-add": "Short edit tag name for image tags that were added from the mobile apps.",
	"tag-app-image-tag-add-description": "Edit tag description for image tags that were added from the mobile apps",
	"tag-app-image-tag-add-helppage": "Link to a page where users learn about the feature for image tags that were added from the mobile apps",
	"tag-app-image-add-top": "Short edit tag name for images that were added to the top of the article from the mobile apps.",
	"tag-app-image-add-top-description": "Edit tag description for images that were added to the top of the article from the mobile apps",
	"tag-app-image-add-top-helppage": "Link to a page where users learn about the feature for images that were added to the top of the article from the mobile apps",
	"tag-app-image-add-infobox": "Short edit tag name for images that were added to the infobox from the mobile apps.",
	"tag-app-image-add-infobox-description": "Edit tag description for images that were added to the infobox from the mobile apps",
	"tag-app-image-add-infobox-helppage": "Link to a page where users learn about the feature for images that were added to the infobox from the mobile apps",
	"tag-app-ai-assist": "Short edit tag name for machine-assisted edits that were made from the mobile apps",
	"tag-app-ai-assist-description": "Edit tag description for machine-assisted edits that were made from the mobile apps",
	"tag-mobile_app_edit": "Short edit tag name for edits that have been made from the mobile apps.\n\nSee also:\n* {{msg-mw|Tag-mobile app edit-description}}\n* {{msg-mw|Tag-android app edit}}\n* {{msg-mw|Tag-ios app edit}}",
	"tag-mobile_app_edit-description": "Edit tag description for edits that have been made from the mobile apps.\n\nSee also:\n* {{msg-mw|Tag-mobile app edit}}\n* {{msg-mw|Tag-android app edit-description}}\n* {{msg-mw|Tag-ios app edit-description}}",
	"tag-android_app_edit": "Short edit tag name for edits that have been made from the mobile app for [[w:Android (operating system)|Android]].\n\nSee also:\n* {{msg-mw|Tag-android app edit-description}}\n* {{msg-mw|Tag-mobile app edit}}\n* {{msg-mw|Tag-ios app edit}}",
	"tag-android_app_edit-description": "Edit tag description for edits that have been made from the mobile app for [[w:Android (operating system)|Android]].\n\nSee also:\n* {{msg-mw|Tag-android app edit}}\n* {{msg-mw|Tag-mobile app edit-description}}\n* {{msg-mw|Tag-ios app edit-description}}",
	"tag-ios_app_edit": "Short edit tag name for edits that have been made from the mobile app for [[w:iOS|iOS]].\n\nSee also:\n* {{msg-mw|Tag-ios app edit-description}}\n* {{msg-mw|Tag-android app edit}}\n* {{msg-mw|Tag-mobile app edit}}",
	"tag-ios_app_edit-description": "Edit tag description for edits that have been made from the mobile app for [[w:iOS|iOS]].\n\nSee also:\n* {{msg-mw|Tag-ios app edit}}\n* {{msg-mw|Tag-android app edit-description}}\n* {{msg-mw|Tag-mobile app edit-description}}",
	"abusefilter-edit-builder-vars-user-app": "AbuseFilter extension rule variable that allows distinguishing edits based on if they have been made using the Wikipedia App or not. ($1 is the text that will be inserted into the filter code editor.)"
}
